src/Catalogs/Attributes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Attributes</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Catalogs</xr:Item>
				<xr:Item>Catalog.AccountingRegisters</xr:Item>
				<xr:Item>Catalog.AccumulationRegisters</xr:Item>
				<xr:Item>Catalog.ChartsOfCharacteristicTypes</xr:Item>
				<xr:Item>Catalog.DataProcessors</xr:Item>
				<xr:Item>Catalog.Documents</xr:Item>
				<xr:Item>Catalog.InformationRegisters</xr:Item>
				<xr:Item>Catalog.Reports</xr:Item>
				<xr:Item>Catalog.ChartsOfAccounts</xr:Item>
				<xr:Item>Catalog.BusinessProcesses</xr:Item>
				<xr:Item>Catalog.CalculationRegisters</xr:Item>
				<xr:Item>Catalog.ChartsOfCalculationTypes</xr:Item>
				<xr:Item>Catalog.ExchangePlans</xr:Item>
				<xr:Item>Catalog.TabularSections</xr:Item>
				<xr:Item>Catalog.Tasks</xr:Item>
				<xr:Item>Catalog.Sequences</xr:Item>
				<xr:Item>Catalog.Recalculations</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Kind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AttributeKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Deleted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingFlag</Name>
					<Comment>only for dimensions and resources (AccountingRegisters)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AccountingFlags</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Balance</Name>
					<Comment>only for dimensions and resources (AccountingRegisters)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseDimension</Name>
					<Comment>only for dimensions (CalculationRegisters)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChoiceFoldersAndItems</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FoldersAndItemsUse</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChoiceForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Forms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChoiceHistoryOnInput</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ChoiceHistoryOnInput</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChoiceParameterLinks</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ChoiceParameterLinks</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChoiceParameters</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ChoiceParameters</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Config</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Configurations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateOnInput</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CreateOnInput</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataHistory</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DataHistoryUse</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DenyIncompleteValues</Name>
					<Comment>only for dimensions</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EditFormat</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LocaleStrings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtDimensionAccountingFlag</Name>
					<Comment>only for dimensions and resources (AccountingRegisters)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ExtDimensionAccountingFlags</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtendedEdit</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FillChecking</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FillChecking</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FillFromFillingValue</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FillValue</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Values</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Format</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LocaleStrings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullTextSearch</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FullTextSearchUsing</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Indexing</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Indexing</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LinkByType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TypeLinks</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MainFilter</Name>
					<Comment>only for dimensions (InformationRegisters)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MarkNegatives</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Mask</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Master</Name>
					<Comment>only for dimensions (InformationRegisters)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MaxValue</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Values</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MinValue</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Values</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MultiLine</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PasswordMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QuickChoice</Name>
					<Type>
						<v8:Type>cfg:EnumRef.UseQuickChoice</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Synonym</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LocaleStrings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ToolTip</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LocaleStrings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Types</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseInTotals</Name>
					<Comment>only for dimensions (AccumulationRegisters)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/AttributeKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>AttributeKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Dimension</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Resource</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Attribute</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Attributes/Ext/ManagerModule.bsl
Function Load(Context, Data) Export
	Var Object, CacheItem;
	
	Config = Context.Config;
	Owner  = Context.Owner;
	Cache  = Context.Cache;
	Path   = Context.Path;
	
	// precondition:
	// # (Config == Owner.Owner)
	
	This = Catalogs.Attributes;
	MetaName = "Attribute";
	
	Properties = Data.Properties;
	UUID = Data.UUID; 
	Kind = Enums.AttributeKinds[Data.Type().Name];
	
	CacheItem = Meta.CacheItem(Cache, MetaName, New Structure("UUID", UUID));  
	
	CacheItem.Owner = Owner;	
	CacheItem.Name = Properties.Name;
	CacheItem.Kind = Kind;
	
	BeginTransaction();
	
	Object = Meta.GetObject(This, CacheItem);
	
	// Cached fields  
		
	FillPropertyValues(Object, CacheItem, CachedFields());
	
	// Properties
	
	Object.Config = Config;
	
	Abc.Fill(Object, Properties, Abc.Lines(
		"ChoiceFoldersAndItems"
		"ChoiceHistoryOnInput"
		"Comment"
		"CreateOnInput"
		"ExtendedEdit"
		"FillChecking"
		"FillFromFillingValue"
		"FullTextSearch"
		"Indexing"
		"MarkNegatives"
		"Mask"
		"MultiLine"
		"PasswordMode"
		"QuickChoice"
	));
	
	If Kind = Enums.AttributeKinds.Dimension Then
		Abc.Fill(Object, Properties, Abc.Lines(
			"Balance"
			"BaseDimension"
			"DenyIncompleteValues"
			"MainFilter"
			"Master"
			"UseInTotals"
		));	
	EndIf; 
	
	Meta.UpdateStrings(Config, CacheItem.Ref, Object, Properties, Abc.Lines(
	    "Synonym"
		"EditFormat"
		"Format"
		"ToolTip"
	));
		
	Object.Write();	
	
	CommitTransaction();
	
	Return CacheItem.Ref;
	
EndFunction // Load()

Function CachedFields() Export
	
	Return "UUID, Name, Owner, Kind";
	
EndFunction // CachedFields()

Function Cache(Config) Export
	
	Query = New Query;
	Query.SetParameter("Config", Config);
	Query.Text = StrTemplate(
		"SELECT
		|	Ref, %1
		|FROM Catalog.Attributes
		|WHERE
		|	Config = &Config AND NOT Deleted",
		CachedFields()
	);
	
	Table = Query.Execute().Unload();
	
	Table.Columns.Add("Mark", New TypeDescription("Boolean"));
	
	Table.Indexes.Add("UUID");
	
	Return Table;
	
EndFunction // Cache()
